Revit 2024 API
BuiltInFailures.WallFailures.RecursionParameterIgnored Property
 Parameter-defined type of curtain panels defined in a circular way and will be ignored.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RecursionParameterIgnored { get; }
Visual Basic
Public Shared ReadOnly Property RecursionParameterIgnored As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RecursionParameterIgnored {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace